# ParameterSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterSet Class
Members See Also
---
A set that contains parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ParameterSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class ParameterSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class ParameterSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ParameterSet
# See Also
ParameterSet Members
Autodesk.Revit.DB Namespace